backend/controllers/AutomationSettingsController.php

INSERT INTO `automation_settings` (`code`, `name`, `hours`) VALUES ('RT/2020/0005', 'ON ROAD DEVICES', 72)
---
    public function actionCreate()
    {
        $model = new AutomationSettings();

        $model->code = Receipt::findAutomationCode();

        if ($model->load(Yii::$app->request->post())) {

            $model->name =  strtoupper(strtolower($model->name));
            $model->save();

SELECT * FROM `automation_settings` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = AutomationSettings::findOne($id)) !== null) {