backend/controllers/CompanyDetailsController.php

    protected function findModel($id)
    {
        if (($model = CompanyDetails::findOne($id)) !== null) {
---
SELECT * FROM `company_details` WHERE `id`='1'