backend/controllers/EmployeesController.php

    public function actionViewAdministrator($id)
    {
        if (!Yii::$app->user->isGuest) {

            $user = User::findOne(['employee_id' => $id]);
---
SELECT * FROM `user` WHERE `employee_id`='5'

    protected function findModel($id)
    {
        if (($model = Employees::findOne($id)) !== null) {
---
SELECT * FROM `employees` WHERE `id`='5'