backend/views/fault-devices-report/_searchOnRoadReport.php

SELECT * FROM `border_port` WHERE `location`=1
---
                        <div class="col-md-4">

                            <?php
                            echo $form->field($model, 'border')->widget(Select2::classname(), [
                                'data' => \yii\helpers\ArrayHelper::map(\backend\models\BorderPort::find()->where(['location' => 1])->all(), 'id', 'name'),
                                'language' => 'en',
                                'options' => ['placeholder' => '--select Border--',],
                                'pluginOptions' => [
                                    'allowClear' => true
                                ],
                            ]);