backend/views/employees/employee_details.php

                [
                    'label' => 'Username',
                    'value' => function($model){
                        $user = \backend\models\User::find()->select('username')->where(['employee_id'=>$model->id])->one();
---
SELECT `username` FROM `user` WHERE `employee_id`=5


                    'label' => 'Email',
                    'value' => function($model){
                        $user = \backend\models\User::find()->select('email')->where(['employee_id'=>$model->id])->one();
---
SELECT `email` FROM `user` WHERE `employee_id`=5


                    'label' => 'Role',
                    'value' => function($model){
                        $user = \backend\models\User::find()->select('role')->where(['employee_id'=>$model->id])->one();
---
SELECT `role` FROM `user` WHERE `employee_id`=5


                    'label' => 'User Type',
                    'value' => function($model){
                        $user = \backend\models\User::find()->select('user_type')->where(['employee_id'=>$model->id])->one();
---
SELECT `user_type` FROM `user` WHERE `employee_id`=5


                    'label' => 'Status',
                    'value' => function($model){
                        $user = \backend\models\User::find()->select('status')->where(['employee_id'=>$model->id])->one();
---
SELECT `status` FROM `user` WHERE `employee_id`=5