backend/views/employees/indexAdministrator.php

SELECT `status` FROM `user` WHERE `employee_id`=5
---
                                'dataProvider' => $dataProvider,
                                'filterModel' => $searchModel,
                                'rowOptions' => function ($model) {
                                    $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `username` FROM `user` WHERE `employee_id`=5
---

                                        'label' => 'Username',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('username')->where(['employee_id' => $model->id])->one();

SELECT `email` FROM `user` WHERE `employee_id`=5
---

                                        'label' => 'Email',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('email')->where(['employee_id' => $model->id])->one();

SELECT `role` FROM `user` WHERE `employee_id`=5
---

                                        'label' => 'Role',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('role')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=5
---
                                        'label' => 'Status',

                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=2
---
                                'dataProvider' => $dataProvider,
                                'filterModel' => $searchModel,
                                'rowOptions' => function ($model) {
                                    $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `username` FROM `user` WHERE `employee_id`=2
---

                                        'label' => 'Username',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('username')->where(['employee_id' => $model->id])->one();

SELECT `email` FROM `user` WHERE `employee_id`=2
---

                                        'label' => 'Email',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('email')->where(['employee_id' => $model->id])->one();

SELECT `role` FROM `user` WHERE `employee_id`=2
---

                                        'label' => 'Role',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('role')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=2
---
                                        'label' => 'Status',

                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=1
---
                                'dataProvider' => $dataProvider,
                                'filterModel' => $searchModel,
                                'rowOptions' => function ($model) {
                                    $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `username` FROM `user` WHERE `employee_id`=1
---

                                        'label' => 'Username',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('username')->where(['employee_id' => $model->id])->one();

SELECT `email` FROM `user` WHERE `employee_id`=1
---

                                        'label' => 'Email',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('email')->where(['employee_id' => $model->id])->one();

SELECT `role` FROM `user` WHERE `employee_id`=1
---

                                        'label' => 'Role',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('role')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=1
---
                                        'label' => 'Status',

                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=3
---
                                'dataProvider' => $dataProvider,
                                'filterModel' => $searchModel,
                                'rowOptions' => function ($model) {
                                    $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `username` FROM `user` WHERE `employee_id`=3
---

                                        'label' => 'Username',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('username')->where(['employee_id' => $model->id])->one();

SELECT `email` FROM `user` WHERE `employee_id`=3
---

                                        'label' => 'Email',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('email')->where(['employee_id' => $model->id])->one();

SELECT `role` FROM `user` WHERE `employee_id`=3
---

                                        'label' => 'Role',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('role')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `employee_id`=3
---
                                        'label' => 'Status',

                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('status')->where(['employee_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `company_id`=1
---
                                'dataProvider' => $dataProvider,
                                'filterModel' => $searchModel,
                                'rowOptions' => function ($model) {
                                    $user = \backend\models\User::find()->select('status')->where(['company_id' => $model->id])->one();

SELECT `username` FROM `user` WHERE `company_id`=1
---

                                        'label' => 'Login Username',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('username')->where(['company_id' => $model->id])->one();

SELECT `email` FROM `user` WHERE `company_id`=1
---

                                        'label' => 'Email',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('email')->where(['company_id' => $model->id])->one();

SELECT `role` FROM `user` WHERE `company_id`=1
---

                                        'label' => 'Role',
                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('role')->where(['company_id' => $model->id])->one();

SELECT `status` FROM `user` WHERE `company_id`=1
---

                                    ],

                                    [

                                        'label' => 'Status',

                                        'value' => function ($model) {
                                            $user = \backend\models\User::find()->select('status')->where(['company_id' => $model->id])->one();

                                            if ($user->status == User::STATUS_ACTIVE) {
                                                return 'ACTIVE';
                                            } elseif ($user->status == User::STATUS_DELETED) {
                                                return 'DISABLED';
                                            } elseif ($user->status == User::STATUS_INACTIVE) {
                                                return 'DISABLED';
                                            }

                                        },

                                    ],