backend/views/released-devices/index.php

    ?>
    <?php if(Yii::$app->user->can('transferDevices')){ ?>
    <?= Html::beginForm(['released-devices/transfer'], 'post'); ?>
    <?=  Html::dropDownList("action","",ArrayHelper::map(\backend\models\User::find()->where(['user_type'=>\backend\models\User::PORT_STAFF])->all(),'id','username'),['prompt' => '--- Sales Person ---']) ; ?>
    <?=  Html::dropDownList("points","",ArrayHelper::map(\backend\models\BorderPort::find()->where(['location'=>2])->all(),'id','name'),['prompt' => '--- Sales Point ---']) ; ?>
---
SELECT * FROM `user` WHERE `user_type`=3
SELECT * FROM `border_port` WHERE `location`=2