backend/models/BorderPort.php

SELECT * FROM `border_port` WHERE `location`=1
---
    public static function getBordersPorts()
    {
        return ArrayHelper::map(BorderPort::find()->where(['location'=>1])->all(),'id','name');