backend/models/Receipt.php

    public static function findAutomationCode()
    {

        $model = AutomationSettings::find()->all();
---
SELECT * FROM `automation_settings`