backend/models/SystemModule.php

    public static function getAll()
    {
        return ArrayHelper::map(SystemModule::find()->all(),'id','name');
---
SELECT * FROM `tbl_system_module`