backend/models/User.php

    public static function getAllUser()
    {
        return ArrayHelper::map(User::find()->where(['!=', 'user_type', User::SUPER_ADMIN])->all(),'id','username');
---
SELECT * FROM `user` WHERE `user_type` != 0