backend/models/User.php

SELECT * FROM `user` WHERE `user_type` IN (1, 2)
---
    public static function getOfficeUser()
    {
        return ArrayHelper::map(User::find()->where(['in','user_type',[1,2]])->all(),'id','username');

SELECT * FROM `auth_item` WHERE (`type`='1') AND (`name` = 'Administrator')
---
    public static function getRules()
    {
        if(Yii::$app->user->identity->user_type == User::SUPER_ADMIN){

            return ArrayHelper::map(AuthItem::find()->where(['type'=>"1"])->all(),'name','name');

        }else{

            return ArrayHelper::map(AuthItem::find()
                ->where(['type'=>"1"])->andWhere(['!=', 'name', 'SuperAdministrator'])->all(),'name','name');

SELECT * FROM `user` WHERE `user_type` != 0
---
    public static function getAllUser()
    {
        return ArrayHelper::map(User::find()->where(['!=', 'user_type', User::SUPER_ADMIN])->all(),'id','username');

SELECT * FROM `user` WHERE `user_type` IN (3, 4)
---
    public static function getBorderPortUser()
    {
        return ArrayHelper::map(User::find()->where(['in','user_type',[3,4]])->all(),'id','username');